Revit 2026 API

# WaveWaveNumWaveSets Property

---

The property labeled "Number" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveNumWaveSets { get; }
```
```vb
Public Shared ReadOnly Property WaveNumWaveSets As String
	Get
```
```cpp
public:
static property String^ WaveNumWaveSets {
	String^ get ();
}
```
```fsharp
static member WaveNumWaveSets : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" within the range of "1, 50".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace